src/DataProcessors/ЗапускЗаданияSQL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗапускЗаданияSQL</Name>
			<Comment>DEV-9782</Comment>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>SQLПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.SQLТипыПараметров</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ЗапускЗаданияSQL/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ВыполнитьJobНаСервере()
	//Попытка
	//		ОЛАПСоединение = Новый COMОбъект("ADODB.Connection"); 
	//		ОЛАПСоединение.CursorLocation=3;
	//		//ОЛАПСоединение.ConnectionString="Provider=SQLOLEDB.1;Integrated Security=SSPI;Persist Security Info=False;Initial Catalog=dolphin_1;Data Source=sqlolap";
	//		ТекБаза = Константы.ТекущаяБаза.Получить();
	//		Если ТекБаза = Перечисления.ИнформационныеБазы.База1 Тогда
	//			ОЛАПСоединение.ConnectionString="Provider=SQLOLEDB.1;Password=G!J)-p43*VR5;Persist Security Info=True;User ID=Log1Cviewer;Initial Catalog=dolphin_1;Data Source=sqlolap";
	//			//ОЛАПСоединение.ConnectionString="Provider=SQLOLEDB.1;Integrated Security=SSPI;Persist Security Info=True;User ID=Log1Cviewer;Initial Catalog=dolphin_1;Data Source=sqlolap";
	//		ИначеЕсли ТекБаза = Перечисления.ИнформационныеБазы.База2 Тогда
	//			ОЛАПСоединение.ConnectionString="Provider=SQLOLEDB.1;Password=G!J)-p43*VR5;Persist Security Info=True;User ID=Log1Cviewer;Initial Catalog=dolphin_n;Data Source=sqlolap";
	//		КонецЕсли;
	//		
	//		ОЛАПСоединение.Open(); 
	//		ЗапросАДО = Новый COMОбъект("ADODB.Command"); 
	//		ExecuteOptionEnum = Новый Структура ("adAsyncExecute, adAsyncFetch, adAsyncFetchNonBlocking, adExecuteNoRecords, adExecuteStream, adOptionUnspecified", 16, 32, 64, 128, 1024, -1);
	//		
	//		ЗапросАДО.CommandText = "prtr1CDBQueryForUpdateAdd";
	//		ЗапросАДО.CommandType=4;
	//		ЗапросАДО.CommandTimeout = 90;
	//		ЗапросАДО.ActiveConnection = ОЛАПСоединение;
	//		ЗапросАДО.Parameters.Refresh();
	//		ЗапросАДО.Parameters(1).Value="Справочник."+Строка(ТипЗнч(ЗначениеСтарое));
	//		ЗапросАДО.Parameters(2).Value=Строка(guidСтарый);
	//		ЗапросАДО.Parameters(3).Value=Строка(guidНовый);
	//		ЗапросАДО.Parameters(4).Value=Пользователь.Имя;
	//		ЗапросАДО.Parameters(5).Value=Лев(ЗначениеСтарое.Код,20);
	//		ЗапросАДО.Parameters(6).Value=Лев(ЗначениеНовое.Код,20);
	//		ЗапросАДО.Parameters(7).Value=Лев(ЗначениеСтарое.Наименование,150);
	//		ЗапросАДО.Parameters(8).Value=Лев(ЗначениеНовое.Наименование,150);
	//		ЗапросАДО.Execute();

	//		ОЛАПСоединение.Close();
	//		ЗначениеСтароеОбъект = ЗначениеСтарое.ПолучитьОбъект();
	//		ЗначениеСтароеОбъект.ПометкаУдаления=Истина;
	//		Если ТипЗнч(ЗначениеСтарое)=Тип("СправочникСсылка.Контрагенты") Тогда
	//			НаборЗаписейРегистра = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	//			НаборЗаписейРегистра.Отбор.Объект.Значение = ЗначениеСтарое;
	//			НаборЗаписейРегистра.Отбор.Объект.Использование = Истина;
	//            НаборЗаписейРегистра.Записать();
	//			
	//			//НаборЗаписейРегистра = РегистрыСведений.МенеджерыКонтрагенты.СоздатьНаборЗаписей();
	//			//НаборЗаписейРегистра.Отбор.Контрагент.Значение = ЗначениеСтарое;
	//			//НаборЗаписейРегистра.Отбор.Контрагент.Использование = Истина;
	//			//НаборЗаписейРегистра.Прочитать();
	//			//НаборЗаписейРегистра.Записать();
	//			//Запрос = Новый Запрос;
	//			//Запрос.Текст = 
	//			//	"ВЫБРАТЬ
	//			//	|	ABCКлассификацияПокупателейПоВидамНоменклатурыТаблицаРаспределенияКонтрагентов.Ссылка
	//			//	|ИЗ
	//			//	|	Документ.ABCКлассификацияПокупателейПоВидамНоменклатуры.ТаблицаРаспределенияКонтрагентов КАК ABCКлассификацияПокупателейПоВидамНоменклатурыТаблицаРаспределенияКонтрагентов
	//			//	|ГДЕ
	//			//	|	ABCКлассификацияПокупателейПоВидамНоменклатурыТаблицаРаспределенияКонтрагентов.Контрагент = &Контрагент";

	//			//Запрос.УстановитьПараметр("Контрагент", ЗначениеСтарое);
	//			//Результат = Запрос.Выполнить();
	//			//ВыборкаДетальныеЗаписи = Результат.Выбрать();

	//			//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//			//	//ABCОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	//			//	////ABCОбъект.ПометкаУдаления=Истина;
	//			//	//ABCОбъект.Проведен = Ложь;
	//			//	//ABCОбъект.Записать();
	//			//	//ABCОбъект.ПометкаУдаления = Истина;
	//			//	//ABCОбъект.Записать();
	//			//	НаборЗаписейРегистра = РегистрыСведений.ABCКлассификацияПокупателейПоВидамНоменклатуры.СоздатьНаборЗаписей();
	//			//	НаборЗаписейРегистра.Отбор.Регистратор.Значение = ВыборкаДетальныеЗаписи.Ссылка;
	//			//	НаборЗаписейРегистра.Отбор.Регистратор.Использование = Истина;
	//			//	НаборЗаписейРегистра.Записать();
	//			//КонецЦикла;
	//		ИначеЕсли ТипЗнч(ЗначениеСтарое)=Тип("СправочникСсылка.Автотранспорт") Тогда
	//			НаборЗаписейРегистра = РегистрыСведений.НормыРасходаТоплива.СоздатьНаборЗаписей();
	//			НаборЗаписейРегистра.Отбор.Автотранспорт.Значение = ЗначениеСтарое;
	//			НаборЗаписейРегистра.Отбор.Автотранспорт.Использование = Истина;
	//            НаборЗаписейРегистра.Записать();
	//		ИначеЕсли ТипЗнч(ЗначениеСтарое)=Тип("СправочникСсылка.СервиснаяТехника") Тогда
	//			НаборЗаписейРегистра = РегистрыСведений.СервиснаяТехникаЭксплуатируется.СоздатьНаборЗаписей();
	//			НаборЗаписейРегистра.Отбор.СервиснаяТехника.Значение = ЗначениеСтарое;
	//			НаборЗаписейРегистра.Отбор.СервиснаяТехника.Использование = Истина;
	//            НаборЗаписейРегистра.Записать();
	//		ИначеЕсли ТипЗнч(ЗначениеСтарое)=Тип("СправочникСсылка.ФизическиеЛица") Тогда
	//			НаборЗаписейРегистра = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	//			НаборЗаписейРегистра.Отбор.Объект.Значение = ЗначениеСтарое;
	//			НаборЗаписейРегистра.Отбор.Объект.Использование = Истина;
	//            НаборЗаписейРегистра.Записать();
	//			НаборЗаписейРегистра = РегистрыСведений.ФИОФизЛиц.СоздатьНаборЗаписей();
	//			НаборЗаписейРегистра.Отбор.ФизЛицо.Значение = ЗначениеСтарое;
	//			НаборЗаписейРегистра.Отбор.ФизЛицо.Использование = Истина;
	//            НаборЗаписейРегистра.Записать();
	//			НаборЗаписейРегистра = РегистрыСведений.ПаспортныеДанныеФизЛиц.СоздатьНаборЗаписей();
	//			НаборЗаписейРегистра.Отбор.ФизЛицо.Значение = ЗначениеСтарое;
	//			НаборЗаписейРегистра.Отбор.ФизЛицо.Использование = Истина;
	//            НаборЗаписейРегистра.Записать();
	//			НаборЗаписейРегистра = РегистрыСведений.ГражданствоФизЛиц.СоздатьНаборЗаписей();
	//			НаборЗаписейРегистра.Отбор.ФизЛицо.Значение = ЗначениеСтарое;
	//			НаборЗаписейРегистра.Отбор.ФизЛицо.Использование = Истина;
	//            НаборЗаписейРегистра.Записать();
	//			НаборЗаписейРегистра = РегистрыСведений.ноПланСвязьРуководительМенеджер.СоздатьНаборЗаписей();
	//			НаборЗаписейРегистра.Отбор.Подчиненный.Значение = ЗначениеСтарое;
	//			НаборЗаписейРегистра.Отбор.Подчиненный.Использование = Истина;
	//            НаборЗаписейРегистра.Записать();
	//		ИначеЕсли ТипЗнч(ЗначениеСтарое)=Тип("СправочникСсылка.Пользователи") Тогда
	//			НаборЗаписейРегистра = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
	//			НаборЗаписейРегистра.Отбор.Пользователь.Значение = ЗначениеСтарое;
	//			НаборЗаписейРегистра.Отбор.Пользователь.Использование = Истина;
	//            НаборЗаписейРегистра.Записать();
	//			НаборЗаписейРегистра = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	//			НаборЗаписейРегистра.Отбор.Объект.Значение = ЗначениеСтарое;
	//			НаборЗаписейРегистра.Отбор.Объект.Использование = Истина;
	//            НаборЗаписейРегистра.Записать();
	//			НаборЗаписейРегистра = РегистрыСведений.МенеджерыПрава.СоздатьНаборЗаписей();
	//			НаборЗаписейРегистра.Отбор.Менеджер.Значение = ЗначениеСтарое;
	//			НаборЗаписейРегистра.Отбор.Менеджер.Использование = Истина;
	//            НаборЗаписейРегистра.Записать();
	//			НаборЗаписейРегистра = РегистрыСведений.ноСвязьРуководительМенеджерУпр.СоздатьНаборЗаписей();
	//			НаборЗаписейРегистра.Отбор.Подчиненный.Значение = ЗначениеСтарое;
	//			НаборЗаписейРегистра.Отбор.Подчиненный.Использование = Истина;
	//            НаборЗаписейРегистра.Записать();
	//		КонецЕсли;
	//		ЗначениеСтароеОбъект.Записать();
	//	Исключение 	
	//		Инфо = ИнформацияОбОшибке();
	//		Сообщение = Новый СообщениеПользователю();
	//		СообщениеТекст=ПодробноеПредставлениеОшибки(Инфо);
	//		НомерСтроки=СтрЧислоСтрок(СообщениеТекст); 
	//		//"по причине:"
	//	    Сообщение.Текст = СтрПолучитьСтроку(СообщениеТекст,НомерСтроки);
	//	    Сообщение.Сообщить();	
	//	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Задание) Тогда
		Сооб = Новый СообщениеПользователю;
		Сооб.Текст = "Не выбрано задание!";
		Сооб.Сообщить();
		Возврат;
	КонецЕсли;

	
	Структура = Новый Структура;
	Для Каждого Стр Из Объект.SQLПараметры Цикл 
		Если ЗначениеЗаполнено(Стр.Значение) Тогда
			Структура.Вставить(Стр.Имя, Стр.Значение);
		Иначе
			Сооб = Новый СообщениеПользователю;
			Сооб.Текст = "Не задан параметр " + Стр.Имя;
			Сооб.Сообщить();
			Возврат;
		КонецЕсли;
	КонецЦикла;
	СтрокаИдентификатора = Строка(ТекущаяДата()) + "," + Строка(Пользователи.ТекущийПользователь());
	SQLВыполнениеЗаданий.ДобавитьЗаписьВРегистрВыполнениеЗаданий(Задание, Структура, СтрокаИдентификатора);
	ЗапуститьРегламентноеЗадание();

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьJob(Команда)
	ВыполнитьJobНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ЗаданиеПриИзмененииНаСервере()
	Объект.SQLПараметры.Очистить();
	Если ЗначениеЗаполнено(Задание) Тогда
		Для Каждого Стр Из Задание.SQLПараметры Цикл
			НовыйСтр = Объект.SQLПараметры.Добавить();
			НовыйСтр.Имя = Стр.Имя; 
			НовыйСтр.Значение = ТипДляЗначения(Стр.НазваниеТипа); 			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеПриИзменении(Элемент)
	ЗаданиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ТипДляЗначения(НазваниеТипа)
	Рез = "";
	Для каждого элТип из Метаданные.ОпределяемыеТипы.SQLТипыПараметров.Тип.Типы() Цикл
		обМетаданных = Метаданные.НайтиПоТипу(элТип);
		
		Если обМетаданных <> Неопределено И обМетаданных.Имя = НазваниеТипа Тогда
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(обМетаданных.ПолноеИмя());
			Рез = МенеджерОбъекта.ПустаяСсылка();
			Прервать;
		КонецЕсли;
		
	КонецЦикла; 	
	Возврат Рез;
КонецФункции  

&НаСервере
Процедура ЗапуститьРегламентноеЗадание()
   ИмяМетода = Метаданные.РегламентныеЗадания.SQLВыполнениеЗаданий.ИмяМетода;

   // Проверка, выполняется ли фоновое задание.
   Отбор = Новый Структура;
   Отбор.Вставить("ИмяМетода", ИмяМетода);
   Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
   ФоновыеЗаданияВыполнениеЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
   Если ФоновыеЗаданияВыполнениеЗаданий.Количество() = 0 Тогда
      НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
        НСтр("ru = 'Запуск вручную: %1'"), "SQL выполнение заданий");
      ФоновыеЗадания.Выполнить(ИмяМетода,,, НаименованиеФоновогоЗадания);
   КонецЕсли;
КонецПроцедуры
